stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
        /* Activate NSS line and hold it if wakeup is needed */
        if (wakeup_delay_required != FALSE)
        {
            const sid_pal_serial_bus_stm32wbaxx_transaction_config_t * const spi_transaction_cfg = (sid_pal_serial_bus_stm32wbaxx_transaction_config_t *)drv_ctx->config->spi_client_cfg->client_selector_extension;
            const uint32_t nss_to_nss_delay = ((spi_transaction_cfg->nss_to_nss_cycles * 1000000u) + drv_ctx->config->spi_client_cfg->speed_hz) / drv_ctx->config->spi_client_cfg->speed_hz; /* Round-up */

            /* Ensure NSS-to-NSS delay is respected */
            sid_pal_delay_us(nss_to_nss_delay);

            sid_err = sid_pal_serial_bus_ext_ifc_activate_nss(drv_ctx->bus_iface, drv_ctx->config->spi_client_cfg);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to activate STM32WLxx NSS line for wakeup. sid_pal_serial_bus_spi error %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_SPI_XFER;
                break;
            }

            /* Wait for STM32WLxx MCU to wakeup */
            if (STM32WLxx_HAL_STM32WLxx_WAKEUP_TIME_US > nss_to_nss_delay)
            {
                sid_pal_delay_us(STM32WLxx_HAL_STM32WLxx_WAKEUP_TIME_US - nss_to_nss_delay);
            }
        }
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

        /* Do the transfer */
        sid_err = drv_ctx->bus_iface->xfer(drv_ctx->bus_iface, drv_ctx->config->spi_client_cfg, (uint8_t *)tx_buf, (uint8_t *)rx_buf, STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to xfer single SPI frame to STM32WLxx. sid_pal_serial_bus_spi error %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_SPI_XFER;
            break;
        }

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
        /* Release the manual NSS control if it was requested */
        if (wakeup_delay_required != FALSE)
        {
            sid_err = sid_pal_serial_bus_ext_ifc_deactivate_nss(drv_ctx->bus_iface, drv_ctx->config->spi_client_cfg);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to deactivate STM32WLxx NSS line after wakeup. sid_pal_serial_bus_spi error %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_SPI_XFER;
                break;
            }
        }
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

        /* Done */
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline stm32wlxx_hal_status_t _spi_transmit_receive_partial_frame(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_buf, uint8_t * const rx_buf, const size_t data_length)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;
    uint8_t full_size_tx_buf[STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE];
    uint8_t full_size_rx_buf[STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE];
    uint8_t * tx_ptr;
    uint8_t * rx_ptr;

    SID_PAL_ASSERT(data_length < STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE);

    STM32WLxx_HAL_LOG_DEBUG("_spi_transmit_data() with padding. %u bytes padded", STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE - data_length);

    do
    {
        if (tx_buf != NULL)
        {
            /* Build Tx buffer with padding */
            SID_STM32_UTIL_fast_memset(full_size_tx_buf, 0u, sizeof(tx_buf));
            SID_STM32_UTIL_fast_memcpy(full_size_tx_buf, tx_buf, data_length);
            tx_ptr = full_size_tx_buf;
        }
        else
        {
            /* No Tx */
            tx_ptr = NULL;
        }

        /* Prepare Rx buffer */
        if (rx_buf != NULL)
        {
            tx_ptr = full_size_rx_buf;
        }
        else
        {
            /* No Rx */
            rx_ptr = NULL;
        }

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
        /* If STM32WLxx can be in an LPM we need to activate NSS and hold it to wakeup the MCU */
        uint32_t wakeup_delay_required = ((SID_PAL_RADIO_SLEEP == drv_ctx->radio_state) || (SID_PAL_RADIO_UNKNOWN == drv_ctx->radio_state)) && (FALSE == drv_ctx->ldt_ongoing) ? TRUE : FALSE;
        if ((wakeup_delay_required != FALSE) && (SID_PAL_RADIO_SLEEP == drv_ctx->radio_state))
        {
            /* There's a special use case for radio in SID_PAL_RADIO_SLEEP but indicating active IRQ - we don't need to wait for wakeup here */
            const uint32_t radio_irq_pin_state = _radio_irq_gpio_filtered_read(drv_ctx);

            if (STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_ACTIVE == radio_irq_pin_state)
            {
                wakeup_delay_required = FALSE;
            }
        }

        /* Activate NSS line and hold it if wakeup is needed */
        if (wakeup_delay_required != FALSE)
        {
            const sid_pal_serial_bus_stm32wbaxx_transaction_config_t * const spi_transaction_cfg = (sid_pal_serial_bus_stm32wbaxx_transaction_config_t *)drv_ctx->config->spi_client_cfg->client_selector_extension;
            const uint32_t nss_to_nss_delay = ((spi_transaction_cfg->nss_to_nss_cycles * 1000000u) + drv_ctx->config->spi_client_cfg->speed_hz) / drv_ctx->config->spi_client_cfg->speed_hz; /* Round-up */

            /* Ensure NSS-to-NSS delay is respected */
            sid_pal_delay_us(nss_to_nss_delay);

            sid_err = sid_pal_serial_bus_ext_ifc_activate_nss(drv_ctx->bus_iface, drv_ctx->config->spi_client_cfg);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to activate STM32WLxx NSS line for wakeup. sid_pal_serial_bus_spi error %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_SPI_XFER;
                break;
            }

            /* Wait for STM32WLxx MCU to wakeup */
            if (STM32WLxx_HAL_STM32WLxx_WAKEUP_TIME_US > nss_to_nss_delay)
            {
                sid_pal_delay_us(STM32WLxx_HAL_STM32WLxx_WAKEUP_TIME_US - nss_to_nss_delay);
            }
        }
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

