stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
        /* Transfer data */
        sid_err = drv_ctx->bus_iface->xfer(drv_ctx->bus_iface, drv_ctx->config->spi_client_cfg, tx_ptr, rx_ptr, STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to xfer single SPI frame to STM32WLxx. sid_pal_serial_bus_spi error %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_SPI_XFER;
            break;
        }

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
        /* Release the manual NSS control if it was requested */
        if (wakeup_delay_required != FALSE)
        {
            sid_err = sid_pal_serial_bus_ext_ifc_deactivate_nss(drv_ctx->bus_iface, drv_ctx->config->spi_client_cfg);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to deactivate STM32WLxx NSS line after wakeup. sid_pal_serial_bus_spi error %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_SPI_XFER;
                break;
            }
        }
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

        /* Copy partial data */
        if (rx_buf != NULL)
        {
            SID_STM32_UTIL_fast_memcpy(rx_buf, full_size_rx_buf, data_length);
        }

        /* Done */
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static stm32wlxx_hal_status_t _spi_transmit_data(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const data, const size_t data_length)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    /* Protect from systematic SW failures */
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->bus_iface != NULL);
    SID_PAL_ASSERT(drv_ctx->bus_iface->xfer != NULL);

    halo_drv_stm32wlxx_ctx_t * const modifiable_drv_ctx = (halo_drv_stm32wlxx_ctx_t *)drv_ctx;

    /* Capture STM32WLxx IRQ line status before the transaction */
    const uint32_t irq_was_enabled = drv_ctx->irq_enabled;

    do
    {
        /* Validate inputs */
        if ((NULL == data) || (0u == data_length))
        {
            err = STM32WLxx_HAL_STATUS_INVALID_ARGS;
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Tx failed - invalid args");
            break;
        }

        /* Disable all STM32WLxx IRQs - if an IRQ is indicated during the ongoing transfer, the IRQ handler will try to read out IRQ status, causing clashes on the SPI line */
        err = stm32wlxx_hal_disarm_irq(modifiable_drv_ctx);
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Tx failed - unble to disarm IRQ line. error %u", (uint32_t)err);
            break;
        }

        if (STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE == data_length)
        {
            /* Data perfectly matches the SPI data frame size - transfer as is */
            err = _spi_transmit_receive_full_frame(drv_ctx, data, NULL, data_length);
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                break;
            }
        }
        else if (data_length > STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE)
        {
            /* Data size exceeds single SPI frame - transfer as long data */
            stm32wlxx_radio_comm_spi_frame_t tx_frame;
            const uint8_t * ingest_ptr = data;
            size_t remaining_bytes = data_length;

            if (data_length > UINT16_MAX)
            {
                STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Tx failed - data is too long");
                err = STM32WLxx_HAL_STATUS_ERROR_DATA_TOO_LONG;
                break;
            }

            /* Prepare the long data start frame */
            stm32wlxx_rcp_ldts_t * const start_payload = &tx_frame.payload.ldts;
            tx_frame.opcode = STM32WLxx_RADIO_COMM_OPCODE_LONG_DATA_START;
            start_payload->full_data_size = (uint16_t)data_length;
            SID_STM32_UTIL_fast_memcpy(start_payload->partial_data, ingest_ptr, sizeof(start_payload->partial_data));

            /* Advance the pointers */
            ingest_ptr += sizeof(start_payload->partial_data);
            remaining_bytes -= sizeof(start_payload->partial_data);

            /* Transmit the starting frame */
            err = _spi_transmit_receive_full_frame(drv_ctx, (uint8_t*)(void *)&tx_frame, NULL, sizeof(tx_frame));
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                break;
            }

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
            /* Indicate active LDT so SPI comm will assume the STM32WLxx side does not need wakeup till the end of the current LDT frame */
            modifiable_drv_ctx->ldt_ongoing = TRUE;
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

            /* Proceed with the continuation packets */
            tx_frame.opcode = STM32WLxx_RADIO_COMM_OPCODE_LONG_DATA_CONT;
            while (remaining_bytes > 0u)
            {
                /* Compute how many bytes we can squeeze into the continuation frame */
                stm32wlxx_rcp_ldtc_t * const continuation_payload = &tx_frame.payload.ldtc;
                const size_t process_length = remaining_bytes > sizeof(continuation_payload->partial_data) ? sizeof(continuation_payload->partial_data) : remaining_bytes;

                /* Populate the upcoming continuation frame */
                SID_STM32_UTIL_fast_memcpy(continuation_payload->partial_data, ingest_ptr, process_length);

                /* Send out the frame */
                if (process_length <  sizeof(continuation_payload->partial_data))
                {
                    err = _spi_transmit_receive_partial_frame(drv_ctx, (uint8_t*)(void *)&tx_frame, NULL, sizeof(tx_frame) - (sizeof(continuation_payload->partial_data) - remaining_bytes));
                }
                else
                {
                    err = _spi_transmit_receive_full_frame(drv_ctx, (uint8_t*)(void *)&tx_frame, NULL, sizeof(tx_frame));
                }

                /* Send out error check */
                if (err != STM32WLxx_HAL_STATUS_OK)
                {
                    break;
                }

                /* Advance the pointers */
                ingest_ptr += process_length;
                remaining_bytes -= process_length;
            }

            /* Jump out if the loop above has terminated abnormally */
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                break;
            }
        }
        else
        {
            /* Data size is smaller than a single SPI frame - use padding */
            err = _spi_transmit_receive_partial_frame(drv_ctx, data, NULL, data_length);
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                break;
            }
        }
    } while (0);

#if STM32WLxx_RADIO_APP_LPM_SUPPORT
    /* Ensure LDT status is cleaned regardless of the outcome */
    modifiable_drv_ctx->ldt_ongoing = FALSE;
#endif /* STM32WLxx_RADIO_APP_LPM_SUPPORT */

    if (irq_was_enabled != FALSE)
    {
        /* Ensure the IRQs are re-enabled after the transaction */
        stm32wlxx_hal_status_t rearm_err = stm32wlxx_hal_arm_irq(modifiable_drv_ctx);
        if (rearm_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI TxRx failed - unble to re-arm IRQ line. error %u", (uint32_t)rearm_err);
        }

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            err = rearm_err;
        }
    }

