stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static stm32wlxx_hal_status_t _send_request_with_ack(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const tx_data,
                                                                               const size_t data_length, const uint32_t timeout_ms)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;

    if ((NULL == tx_data) || (0u == data_length))
    {
        return STM32WLxx_HAL_STATUS_INVALID_ARGS;
    }

    /* Ensure there's no other request with ACK running */
    osStatus_t os_err = osSemaphoreAcquire(drv_ctx->req_completed_wait_lock, 0u);
    if (os_err != osOK)
    {
        /* Radio is busy with some other request */
        SID_PAL_LOG_ERROR("Failed to send request with ACK to STM32WLxx - another request is already running");
        err = STM32WLxx_HAL_STATUS_ERROR_BUSY;

        /* Terminate from here to avoid any collisions with the ongoing transaction */
        return err;
    }

    /* Capture STM32WLxx IRQ line status before the transaction */
    const uint32_t irq_was_enabled = drv_ctx->irq_enabled;

    /* Determine if we are in a task context and can use IRQ and semaphore-based wait mechanism */
    const uint32_t use_polling = (SID_STM32_UTIL_IS_IRQ()) || (irq_was_enabled == FALSE) ? TRUE: FALSE;

    do
    {
        if (FALSE == use_polling)
        {
            /* IRQ-based wait mechanism can be used. Prepare the semaphore to lock the caller task until radio IRQ is reported */
            while (osSemaphoreGetCount(drv_ctx->irq_detected_wait_lock) != 0u)
            {
                os_err = osSemaphoreAcquire(drv_ctx->irq_detected_wait_lock, 0u);
                if (os_err != osOK)
                {
                    STM32WLxx_HAL_LOG_ERROR("Failed to send request with ACK to STM32WLxx - cannot arm IRQ wait mechanism. Error 0x%08X", (uint32_t)os_err);
                    break;
                }
            }

            /* Propagate error to terminate the main while() loop */
            if (os_err != osOK)
            {
                break;
            }
        }
        else
        {
            /* Disable IRQ line - we are going to use polling to monitor IRQ line status because IRQ-based mechanism cannot be used */
            err = stm32wlxx_hal_disarm_irq(drv_ctx);
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_HAL_LOG_ERROR("Failed to send request with ACK to STM32WLxx - unable to disarm IRQ line. error %u", (uint32_t)err);
                break;
            }
        }

        /* Clear the previous IRQ status storage */
        SID_STM32_UTIL_fast_memset((void *)&drv_ctx->last_irq_status, 0u, sizeof(drv_ctx->last_irq_status));

        /* Indicate the request-with-ack transaction is now ongoing */
        drv_ctx->req_with_ack_ongoing = TRUE;

        /* Send the request to STM32WLxx */
        err = _spi_transmit_data(drv_ctx, tx_data, data_length);
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            /* SPI failed */
            STM32WLxx_HAL_LOG_ERROR("Unable to send request with ACK to STM32WLxx. SPI transfer error %u", (uint32_t)err);
            break;
        }

        /* Wait for the IRQ to be indicated by the STM32WLxx side */
        if (FALSE == use_polling)
        {
            /* We are in a task context - just lock on the semaphore until the reset is completed or the timeout happens */
            const uint32_t wait_timeout_ticks = (timeout_ms * osKernelGetTickFreq()) / 1000u;
            os_err = osSemaphoreAcquire(drv_ctx->irq_detected_wait_lock, wait_timeout_ticks);
            if (os_err != osOK)
            {
                /* Check for systematic failures */
                SID_PAL_ASSERT(os_err != osErrorParameter);

                /* Report timeout error */
                err = STM32WLxx_HAL_STATUS_ERROR_TIMEOUT;
                break;
            }
        }
        else
        {
            /* We are in interrupt or interrupt-like context - semaphore cannot be acquired using normal wait states */
            uint32_t accumulated_wait_time = 0u;
            err = STM32WLxx_HAL_STATUS_ERROR_TIMEOUT;

            do
            {
                uint8_t pin_state;

                sid_err = sid_pal_gpio_read(drv_ctx->config->gpio.radio_irq, &pin_state);
                if (SID_ERROR_NONE != sid_err)
                {
                    STM32WLxx_HAL_LOG_ERROR("Unable to read IRQ line state. Error %d", (int32_t)sid_err);
                    err = STM32WLxx_HAL_STATUS_ERROR_HW;
                    break;
                }

                /* Check pin status */
                if (pin_state != STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_ACTIVE)
                {
                    /* No IRQ indicated - wait */
                    sid_pal_delay_us(STM32WLxx_HAL_RADIO_REQUEST_ACK_PROBE_PERIOD_US);
                    accumulated_wait_time += STM32WLxx_HAL_RADIO_REQUEST_ACK_PROBE_PERIOD_US;
                }
                else
                {
                    /* IRQ indicated - we can process it */
                    err = STM32WLxx_HAL_STATUS_OK;
                    break;
                }
            } while (accumulated_wait_time < (timeout_ms * 1000u));

            /* React on ACK wait error */
            if (err != STM32WLxx_HAL_STATUS_OK)
            {
                break;
            }
        }

        /* Regardless of the wait method used, the IRQ is now indicated and can be fetched and processed */
        err = stm32wlxx_hal_generic_irq_process(drv_ctx, NULL);
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            /* Logs provided by stm32wlxx_hal_generic_irq_process() */
            break;
        }

        /* Check if the request was acknowledged */
        if (drv_ctx->req_with_ack_ongoing != FALSE)
        {
            /* Ongoing transcation flag was not cleared by the IRQ handler - report ACK timeout */
            err = STM32WLxx_HAL_STATUS_ERROR_TIMEOUT;
            break;
        }

        /* Everything is fine, request acknowledged via IRQ */
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    /* Ensure we restore IRQ line configuration regardless of success or failure of ACK wait */
    if (irq_was_enabled != FALSE)
    {
        stm32wlxx_hal_status_t rearm_err = stm32wlxx_hal_arm_irq(drv_ctx);
        if (rearm_err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("Sending request with ACK to STM32WLxx failed - unable to re-arm IRQ line. error %u", (uint32_t)rearm_err);
        }

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            err = rearm_err;
        }
    }

