stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
    /* Release the semaphore and clear the flag when we are done regardless of the success */
    drv_ctx->req_with_ack_ongoing = FALSE;
    __COMPILER_BARRIER(); /* Ensure the flag is always cleared before the semaphore is released */
    (void)osSemaphoreRelease(drv_ctx->req_completed_wait_lock);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _radio_irq_gpio_filtered_read(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    /* Perform filtering since Open-Drain line is not immune to EMI and noise ----*/
    register uint32_t    probe_cnt                = 0u;
    register uint32_t    debounce_cnt             = 0u;
    register sid_error_t sid_err;
             uint8_t     pin_state;

    SID_PAL_ASSERT(drv_ctx != NULL);

    do
    {
        /* Wait a bit for pin state to settle */
        sid_pal_delay_us(STM32WLxx_HAL_RADIO_IRQ_PIN_FILTER_PROBE_PERIOD_US);

        sid_err = sid_pal_gpio_read(drv_ctx->config->gpio.radio_irq, &pin_state);
        if (SID_ERROR_NONE != sid_err)
        {
            STM32WLxx_HAL_LOG_ERROR("Unable to read IRQ line state. Error %d", (int32_t)sid_err);

            /* Can't determine IRQ line state - assume IRQ is active, it is safer to react on noise-induced pseudo-event
             * than to skip a real IRQ indication due to GPIO API errors
             */
            debounce_cnt++;
        }
        else
        {
            /* Check pin status */
            if (STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_ACTIVE == pin_state)
            {
                /* IRQ line is driven low */
                debounce_cnt++;
            }
            else
            {
                /* IRQ line is now high, IRQ may have been triggered by a surge */
                debounce_cnt = 0u;
            }
        }

        /* Increment counter and proceed to the next iteration */
        probe_cnt++;
    } while (probe_cnt < STM32WLxx_HAL_RADIO_IRQ_PIN_FILTER_PROBE_COUNT);

    if (debounce_cnt < STM32WLxx_HAL_RADIO_IRQ_PIN_FILTER_PROBE_DEBOUNCE)
    {
        /* Seems the IRQ was accidentally triggered by a glitch - ignore it */
        STM32WLxx_HAL_LOG_DEBUG("IRQ line filtered");
        pin_state = STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_INACTIVE;
    }

    return pin_state;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static void _on_radio_irq_detected(uint32_t pin, void * callback_arg)
{
    struct sid_timespec event_ts;

    /* Store the timestamp as soon as possible */
    (void)sid_pal_uptime_now(&event_ts);
    __COMPILER_BARRIER();

    (void)pin;

    STM32WLxx_HAL_LOG_DEBUG("radio_stm32wlxx_on_radio_irq_detected...");

    halo_drv_stm32wlxx_ctx_t * const drv_ctx = (halo_drv_stm32wlxx_ctx_t *)callback_arg;
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->radio_rx_packet != NULL);

    /**
     * The time-sensitive part is completed, now we can lower Radio IRQ priority to allow other time-critical IRQs to be processed and to enable RTOS API calls below this point
     *
     * WARNING: Dynamic IRQ priority updates within the IRQ handler is supported starting from ARMv7-M architecture (Cortex-M3). For ARMv6-M (Cortex-M0/M0+/M1) priority shall
     *          be changed only when the corresponding IRQ is not active. Due to that radio_irq.prio in the radio driver configuration shall be set to a level that allows RTOS
     *          API calls (e.g. lower (meaning higher number) or equal to configMAX_SYSCALL_INTERRUPT_PRIORITY for FreeRTOS)
     */
#if (__ARM_ARCH_6M__ == 0)
    if (drv_ctx->radio_is_running_high_prio != FALSE)
    {
        /* Store the capture time stamp if this the ISR is in the hard realtime mode */
        drv_ctx->radio_rx_packet->rcv_tm = event_ts;

        /* Lower the IRQ priority */
        (void)sid_pal_gpio_ext_ifc_set_irq_priority(drv_ctx->config->gpio.radio_irq, drv_ctx->config->gpio.radio_irq_prio_low, 0u);
        drv_ctx->radio_is_running_high_prio = FALSE;

        /**
         * Jump out of the ISR to allow NVIC to re-evaluate the priorities
         *
         * WARNING: This is a mandatory step after lower the IRQ priority to enable RTOS API calls. Just lowering the priority is not enough because if this ISR was entered
         *          while the respective priority was high, it will continue to run even after lowering the priority because NVIC does not re-evaluate the priority for an
         *          ISR that is already running. This means proceeding with the execution after lowering the priority still may interfere with the RTOS kernel and ruin the
         *          scheduling, resulting in undefined behavior. To overcome this limitation, the ISR must terminate from here. Since the respective GPIO IRQ is configured to
         *          be triggered by the level on the pin, not the edge, the NVIC will take the IRQ back immediately, but it will now re-evaluate the IRQ priority and call the
         *          ISR only when it is safe to do so from RTOS kernel perspective.
         */
        return;
    }
#else
    /* Just store the capture time stamp and proceed as IRQ priority change is not an option here */
    drv_ctx->radio_rx_packet->rcv_tm = event_ts;
#endif /* __ARM_ARCH_6M__ */

    /* Disable radio IRQ line  to allow the MCU's IRQ handler to return - Sidewalk may process radio IRQ in a RTOS task context */
    stm32wlxx_hal_status_t err = stm32wlxx_hal_disarm_irq(drv_ctx);
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        SID_PAL_LOG_ERROR("Failed to disarm STM32WLxx IRQ line. error %u", (uint32_t)err);
    }

    /* Terminate from here if special IRQ processing is required */
    if (drv_ctx->req_with_ack_ongoing != FALSE)
    {
        (void)osSemaphoreRelease(drv_ctx->irq_detected_wait_lock);
        return;
    }

    /* Schedule generic IRQ processing in the SWI task context */
    drv_ctx->irq_handler();
}

/* Global function definitions -----------------------------------------------*/

