stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_HAL_LOG_ERROR("Unable to retrieve STM32WLxx IRQ status. HAL error %u", (uint32_t)hal_err);
                break;
            }

            STM32WLxx_HAL_LOG_DEBUG("Retrieved STM32WLxx IRQ status. IRQ flags: 0x%x, followup data size: %u", irq_status.irq_flags, irq_status.followup_payload_len);

            /* Check that we have received a valid Handshake IRQ */
            if ((irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_HANDSHAKE) || (irq_status.followup_payload_len != 0u))
            {
                STM32WLxx_HAL_LOG_ERROR("STM32WLxx SPI Handshaking failed. STM32WLxx IRQ does not indicate the desired Handshake status. IRQ flags: 0x%x", irq_status.irq_flags);
                hal_err = STM32WLxx_HAL_STATUS_ERROR_INVALID_STATE;
                break;
            }

            STM32WLxx_HAL_LOG_DEBUG("STM32WLxx IRQ indicates the desired Handshake status");
            handshake_request_active = TRUE;
            hal_err = STM32WLxx_HAL_STATUS_OK;
        } while (0);
    }
    /*----------------------------------------------------------------------------*/

    /* If a valid handshake request is active we need to resend the config -------*/
    if (handshake_request_active != FALSE)
    {
        do
        {
            int32_t err;
            const uint8_t prev_radio_state = drv_ctx->radio_state;

            SID_PAL_LOG_DEBUG("Re-sending radio cfg due to Handshake request");

            /* Send out IRQ acknowledgment to clear the IRQ indication by the STM32WLxx side - this is a mandatory step regardless of the valid or invalid IRQ indication */
            hal_err = stm32wlxx_hal_acknowledge_radio_irq(drv_ctx);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_HAL_LOG_ERROR("Unable to acknowledge STM32WLxx IRQ status. HAL error %u", (uint32_t)hal_err);
                break;
            }

            hal_err = stm32wlxx_hal_wait_radio_irq_released(drv_ctx, STM32WLxx_HAL_RADIO_IRQ_RELEASE_WAIT_TIME_US);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                STM32WLxx_HAL_LOG_ERROR("STM32WLxx failed to release the IRQ line after successful ACK. HAL error %u", (uint32_t)hal_err);
                break;
            }

            /* STM32WLxx radio will be in Standby state at this point and ready to accept config data */
            drv_ctx->radio_state = SID_PAL_RADIO_STANDBY;

            /* Send out SubGHz radio configuration via SPI to STM32WLxx ------------------*/
            err = stm32wlxx_radio_send_subghz_config(FALSE);
            if (err != RADIO_ERROR_NONE)
            {
                /* Logs are provided by stm32wlxx_radio_send_subghz_config() */
                SID_PAL_LOG_ERROR("Failed to re-send SubGHz HW config. Error %d", err);
                hal_err = STM32WLxx_HAL_STATUS_ERROR_HW;
                break;
            }

            /* Perform the final STM32WLxx Sidewalk Radio App initialization steps */
            hal_err = stm32wlxx_hal_apply_base_hw_config(drv_ctx, FALSE);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to apply essential SubGHz HW config. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* Explicitly set modem mode on the remote side */
            hal_err = stm32wlxx_hal_radio_set_modem_mode(drv_ctx, drv_ctx->modem);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to set SubGHz modem mode. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* Restore the selected radio frequency */
            hal_err = stm32wlxx_hal_radio_set_frequency(drv_ctx, drv_ctx->radio_freq_hz);
            if (hal_err != STM32WLxx_HAL_STATUS_OK)
            {
                SID_PAL_LOG_ERROR("Failed to set SubGHz frequency. Error code %u", (uint32_t)hal_err);
                err = RADIO_ERROR_IO_ERROR;
                break;
            }

            /* If the radio was in Sleep before the handshake request send it back into Sleep for power saving */
            if (SID_PAL_RADIO_SLEEP == prev_radio_state)
            {
                hal_err = stm32wlxx_hal_radio_sleep(drv_ctx, 0u, FALSE);
                if (hal_err != STM32WLxx_HAL_STATUS_OK)
                {
                    /* This is not a fatal error. The radio is in Standby already, software may proceed even if the radio failed to enter Sleep back for some reason. There's only power consumption penalty here */
                    SID_PAL_LOG_ERROR("Failed to put STM32WLxx back to sleep. Error code %u", (uint32_t)hal_err);
                    err = RADIO_ERROR_IO_ERROR;
                    drv_ctx->radio_state = SID_PAL_RADIO_UNKNOWN;
                    break;
                }

                /* The radio is back in Sleep now */
                drv_ctx->radio_state = SID_PAL_RADIO_SLEEP;
            }
            else
            {
                /* The radio was in Standby or in some active state (Tx, Rx, etc.) - now it's in Standby as a result of the handshake procedure */
            }

            drv_ctx->error_monitor.drv_err_cntr = 0u;
            SID_PAL_LOG_INFO("Re-synchronized radio config with STM32WLxx");
        } while (0);
    }
    /* End of DANGER ZONE --------------------------------------------------------*/

    if (hal_err != STM32WLxx_HAL_STATUS_OK)
    {
        SID_PAL_LOG_ERROR("STM32WLxx IRQ handling finished with error %u", hal_err);
    }
    STM32WLxx_HAL_LOG_DEBUG("radio_stm32wlxx_on_irq_detected - done");

    return hal_err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_disarm_irq(halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;

