stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
    /* Run in a critical region to ensure consistency of  hardware and logical states */
    sid_pal_enter_critical_region();

    do
    {
        /* Disable IRQ line */
        sid_err = sid_pal_gpio_irq_disable(drv_ctx->config->gpio.radio_irq);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to disable radio IRQ. Error %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
            break;
        }

        /* Disconnect GPIO pin from IRQ line */
        sid_err = sid_pal_gpio_set_irq(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_IRQ_TRIGGER_NONE, NULL, NULL);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to deinit radio IRQ GPIO. Error %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
            break;
        }

        /* Update logical state of IRQ line */
        drv_ctx->irq_enabled = FALSE;

        /* Everything is fine */
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    sid_pal_exit_critical_region();

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_arm_irq(halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;

    /* Run in a critical region to ensure that hardware and logical states are fully configured before the IRQ can be processed */
    sid_pal_enter_critical_region();

    do
    {
#if (__ARM_ARCH_6M__ == 0)
        /**
         * Indicate the radio IRQ is going to use elevated priority
         *
         * WARNING: It's important to do it before calling sid_pal_gpio_set_irq() because the respective ISR may be invoked immediately, before the IRQ priority is actual configured */
        drv_ctx->radio_is_running_high_prio = TRUE;
#endif /* (__ARM_ARCH_6M__ == 0) */

        /* Configure MCU pin to trigger IRQ */
        sid_err = sid_pal_gpio_set_irq(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_IRQ_TRIGGER_LOW, _on_radio_irq_detected, (void*)drv_ctx);
        if (sid_err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to enable STM32WLxx IRQ in NVIC, error %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
            break;
        }

        /* Update logical state of IRQ line */
        drv_ctx->irq_enabled = TRUE;

#if (__ARM_ARCH_6M__ == 0)
        /* Set elevated priority to SX126x IRQ line so we can capture radio IRQ timestamp with more precision */
        sid_err = sid_pal_gpio_ext_ifc_set_irq_priority(drv_ctx->config->gpio.radio_irq, drv_ctx->config->gpio.radio_irq_prio_high, 0u);
#else
        /* Set unified priority to SX126x IRQ line since dynamic IRQ priority changing is not supported */
        sid_err = sid_pal_gpio_ext_ifc_set_irq_priority(drv_ctx->config->gpio.radio_irq, drv_ctx->config->gpio.radio_irq_prio, 0u);
#endif /* (__ARM_ARCH_6M__ == 0) */
        if (sid_err != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed to set STM32WLxx IRQ priority, error %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
            break;
        }

        /* Done */
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    sid_pal_exit_critical_region();

    return err;
}

/*----------------------------------------------------------------------------*/

stm32wlxx_hal_status_t stm32wlxx_hal_gpio_handshake_request(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;
    uint8_t pin_state;

    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);
    SID_PAL_ASSERT(drv_ctx != NULL);

    do
    {
        /* Step 1 - configure IRQ line as input and enable a pull-down */
        sid_err = sid_pal_gpio_pull_mode(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_PULL_DOWN);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("gpio_handshake #1 - failed to enable PD on IRQ. Error: %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
        sid_err = sid_pal_gpio_input_mode(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_INPUT_CONNECT);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("gpio_handshake #1 - failed to set IRQ pin input type. Error: %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
        sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_DIRECTION_INPUT);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("gpio_handshake #1 - failed to set IRQ pin as input. Error: %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
        sid_pal_delay_us(STM32WLxx_HAL_IRQ_LINE_GPIO_SETTLE_TIME_US); /* Wait for pin to settle if it was floating */

        /* Capture pin state */
        sid_err = sid_pal_gpio_read(drv_ctx->config->gpio.radio_irq, &pin_state);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("gpio_handshake #1 - failed to read IRQ pin state. Error: %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }

        if (pin_state != 0u)
        {
            /* IRQ pin is actively driven high by an external source - that's not right since STM32WLxx shall configure
             * IRQ line as an open-drain output without a pull-up on STM32WLxx side
             */
            SID_PAL_LOG_ERROR("Wrong HW state - STM32WLxx radio IRQ line is actively driven high");
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
            break;
        }
        else
        {
            STM32WLxx_HAL_LOG_DEBUG("gpio_handshake #1 - IRQ line is low with PD enabled");
        }

        /* Step 2 - now enable pull-up and check the state */
        sid_err = sid_pal_gpio_pull_mode(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_PULL_UP);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("gpio_handshake #2 - failed to enable PU on IRQ pin. Error: %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }
        sid_pal_delay_us(STM32WLxx_HAL_IRQ_LINE_GPIO_SETTLE_TIME_US); /* Wait for pin to settle if it was floating */

        /* Capture pin state */
        sid_err = sid_pal_gpio_read(drv_ctx->config->gpio.radio_irq, &pin_state);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("gpio_handshake #2 - failed to read IRQ pin state. Error: %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }

        /* Do handshake requests and periodically test if the Handshake state was reached */
        uint32_t accumulated_wait_time = 0u;
        while ((pin_state != 0u) && (accumulated_wait_time < STM32WLxx_HAL_GPIO_HANDSHAKE_WAIT_TIMEOUT_MS))
        {
            /* Either nothing is connected to the radio IRQ line or STM32WLxx is not in the handshake state - do the GPIO handshake request */
            STM32WLxx_HAL_LOG_DEBUG("gpio_handshake #2 - IRQ line is high with PU enabled. Performing open circuit check");

            /* Set output to predefined state before direction configuration to avoid glitches */
            sid_err = sid_pal_gpio_write(drv_ctx->config->gpio.radio_irq, 0u);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("gpio_handshake #2 - failed to drive IRQ pin. Error: %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }

