stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
            /* Configure IRQ line as output, this will actively drive the line low and STM32WLxx shall recognize this as the GPIO handshake request */
            sid_err = sid_pal_gpio_output_mode(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_OUTPUT_OPEN_DRAIN);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("gpio_handshake #2 - failed to set IRQ pin output type. Error: %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_DIRECTION_OUTPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("gpio_handshake #2 - failed configure IRQ pin as output. Error: %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }

            /* Give the STM32WLxx some time to react on the GPIO handshake request */
#ifdef SID_PAL_ENABLE_SCHEDULER_DELAY
            if (SID_STM32_UTIL_IS_IRQ() == FALSE)
            {
                sid_pal_scheduler_delay_ms(STM32WLxx_HAL_GPIO_HANDSHAKE_PROBE_PERIOD_MS);
            }
            else
#endif
            {
                /* Fall back to the blocking delay if scheduler delays are disabled */
                sid_pal_delay_us(STM32WLxx_HAL_GPIO_HANDSHAKE_PROBE_PERIOD_MS * 1000u);
            }

            accumulated_wait_time += STM32WLxx_HAL_GPIO_HANDSHAKE_PROBE_PERIOD_MS;

            /* Step 3 - reconfigure IRQ line back as input with PU enabled and check if the counterpart keeps it low */
            sid_err = sid_pal_gpio_input_mode(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_INPUT_CONNECT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("gpio_handshake #3 - failed to set IRQ pin input type. Error: %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.radio_irq, SID_PAL_GPIO_DIRECTION_INPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("gpio_handshake #3 - failed to set IRQ pin as input. Error: %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }

            /* Wait for pin to settle if it was floating */
            sid_pal_delay_us(STM32WLxx_HAL_IRQ_LINE_GPIO_SETTLE_TIME_US);

            sid_err = sid_pal_gpio_read(drv_ctx->config->gpio.radio_irq, &pin_state);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("gpio_handshake #3 - failed to read IRQ pin state. Error: %d", (int32_t)sid_err);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
        }

        if (err != STM32WLxx_HAL_STATUS_ERROR_GENERIC)
        {
            /* The loop above terminated with some error - just fast-forward it */
            break;
        }

        /* Final check */
        if (pin_state != 0u)
        {
            /* IRQ pin is not driven low - GPIO handshake failed */
            SID_PAL_LOG_ERROR("Wrong HW state - STM32WLxx radio IRQ line is open or STM32WLxx MCU is inoperable");
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
            break;
        }
        else
        {
            if (0u == accumulated_wait_time)
            {
                STM32WLxx_HAL_LOG_DEBUG("gpio_handshake #2 - IRQ line is low with PU enabled. Open circuit check skipped");
            }
            else
            {
                STM32WLxx_HAL_LOG_DEBUG("gpio_handshake #3 - IRQ line is driven low after HS request. Total wait time: %u", accumulated_wait_time);
            }
        }

        /* Final IRQ pin config at this point - input with PU enabled, actively driven low by the STM32WLxx device */
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_subghz_reset(halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t subghz_reset_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_RESET,
        .payload = {
            .subghz_reset_req = {
                .reset_key_1 = STM32WLxx_RADIO_COMM_SUBGHZ_RESET_KEY_1,
                .reset_key_2 = STM32WLxx_RADIO_COMM_SUBGHZ_RESET_KEY_2,
            },
        }
    };

    do
    {
        /* Send out and wait the acknowledgment via IRQ */
        err = _send_request_with_ack(drv_ctx, (void *)&subghz_reset_frame, sizeof(subghz_reset_frame), STM32WLxx_HAL_RADIO_SUBGHZ_RESET_TIMEOUT_MS);

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            /* Everything is fine */
        }
        else if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send STM32WLxx SubGHz reset request - acknowledgment timeout");
            break;
        }
        else
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send STM32WLxx SubGHz reset request. HAL error %u", (uint32_t)err);
            break;
        }

        /* Inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_RESET))
        {
            SID_PAL_LOG_ERROR("SubGHz reset failed. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_RESET, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("SubGHz reset failed. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        STM32WLxx_HAL_LOG_DEBUG("SubGHz Reset request succeeded");
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

