stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_set_subghz_tx_buf(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const data, const uint32_t data_len)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    SID_PAL_ASSERT(drv_ctx->config->internal_buffer.p != NULL);
    SID_PAL_ASSERT(data_len <= STM32WLxx_RADIO_COMM_SUBGHZ_TX_MAX_SIZE);

    stm32wlxx_rcp_set_subghz_tx_buf_t * const set_tx_buf_frame = (stm32wlxx_rcp_set_subghz_tx_buf_t *)(void *)drv_ctx->config->internal_buffer.p;

    set_tx_buf_frame->opcode       = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_TX_BUF;
    set_tx_buf_frame->write_length = (uint16_t)data_len;
    SID_STM32_UTIL_fast_memcpy(set_tx_buf_frame->tx_buf_content, data, data_len);

    uint32_t actual_frame_length = sizeof(*set_tx_buf_frame) - sizeof(set_tx_buf_frame->tx_buf_content) + data_len;

    err = _spi_transmit_data(drv_ctx, (uint8_t *)(void *)set_tx_buf_frame, actual_frame_length);
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        /* SPI failed */
        STM32WLxx_HAL_LOG_ERROR("Unable to send STM32WLxx SubGHz Set Tx Buffer request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_send_subghz_config(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const stm32wlxx_radio_phy_cfg_t * const radio_config, const uint32_t need_ack)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    do
    {
        stm32wlxx_rcp_apply_cfg_t * const send_cfg_frame = (stm32wlxx_rcp_apply_cfg_t *)(void *)drv_ctx->config->internal_buffer.p;

        if (NULL == send_cfg_frame)
        {
            err = STM32WLxx_HAL_STATUS_INVALID_ARGS;
            break;
        }

        if (drv_ctx->config->internal_buffer.size < sizeof(*send_cfg_frame))
        {
            err = STM32WLxx_HAL_STATUS_ERROR_BUFFER_OVERFLOW;
            break;
        }

        /* Construct data */
        send_cfg_frame->opcode   = STM32WLxx_RADIO_COMM_OPCODE_SEND_CONFIG;
        send_cfg_frame->need_ack = need_ack;
        SID_STM32_UTIL_fast_memcpy(&send_cfg_frame->radio_config, radio_config, sizeof(send_cfg_frame->radio_config));

        /* Send out and wait the acknowledgment via IRQ */
        if (need_ack != FALSE)
        {
            err = _send_request_with_ack(drv_ctx, (void *)send_cfg_frame, sizeof(*send_cfg_frame), STM32WLxx_HAL_RADIO_SUBGHZ_SEND_CFG_TIMEOUT_MS);
        }
        else
        {
            err = _spi_transmit_data(drv_ctx, (void *)send_cfg_frame, sizeof(*send_cfg_frame));
        }

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            /* Everything is fine */
            if (FALSE == need_ack)
            {
                STM32WLxx_HAL_LOG_DEBUG("SubGHz config sent to STM32WLxx");
                break;
            }
        }
        else if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send SubGHz config - acknowledgment timeout");
            break;
        }
        else
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send SubGHz config. HAL error %u", (uint32_t)err);
            break;
        }

        /* If ACK was received - inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_SEND_CONFIG))
        {
            SID_PAL_LOG_ERROR("Failed to send SubGHz config. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_SEND_CONFIG, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("Failed to send SubGHz config. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        STM32WLxx_HAL_LOG_DEBUG("SubGHz config sent to STM32WLxx");
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_apply_base_hw_config(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t need_ack)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t apply_cfg_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_APPLY_BASE_HW_CONFIG,
        .payload = {
            .apply_hw_cfg = {
                .need_ack = (uint8_t)need_ack,
            },
        },
    };

    do
    {
        /* Send out and wait the acknowledgment via IRQ */
        if (need_ack != FALSE)
        {
            err = _send_request_with_ack(drv_ctx, (void *)&apply_cfg_frame, sizeof(apply_cfg_frame), STM32WLxx_HAL_RADIO_SUBGHZ_APPLY_CFG_TIMEOUT_MS);
        }
        else
        {
            err = _spi_transmit_data(drv_ctx, (void *)&apply_cfg_frame, sizeof(apply_cfg_frame));
        }

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            /* Everything is fine */
            if (FALSE == need_ack)
            {
                STM32WLxx_HAL_LOG_DEBUG("SubGHz base HW config applied");
                break;
            }
        }
        else if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to apply base SubGHz config - acknowledgment timeout");
            break;
        }
        else
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to apply base SubGHz config. HAL error %u", (uint32_t)err);
            break;
        }

