stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
        /* Inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_APPLY_BASE_HW_CONFIG))
        {
            SID_PAL_LOG_ERROR("Failed to apply base SubGHz config. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_APPLY_BASE_HW_CONFIG, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("Failed to apply base SubGHz config. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        STM32WLxx_HAL_LOG_DEBUG("SubGHz base HW config applied");
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_set_tx_power(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const stm32wlxx_radio_pa_cfg_t * const sid_pa_cfg)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t subghz_set_tx_power_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_TX_POWER,
        .payload = {
            .set_tx_power = {
                .pa_duty_cycle   = sid_pa_cfg->pa_duty_cycle,
                .hp_max          = sid_pa_cfg->hp_max,
                .device_sel      = sid_pa_cfg->device_sel,
                .pa_lut          = sid_pa_cfg->pa_lut,
                .tx_power_reg    = sid_pa_cfg->tx_power_reg,
                .ramp_time       = sid_pa_cfg->ramp_time,
                .target_tx_power = sid_pa_cfg->target_tx_power,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (uint8_t *)(void *)&subghz_set_tx_power_frame, sizeof(subghz_set_tx_power_frame));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        /* SPI failed */
        STM32WLxx_HAL_LOG_ERROR("Unable to send STM32WLxx SubGHz Set Tx Power request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_standby(halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t subghz_standby_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_STANDBY,
        .payload = {
            .raw = {0},
        },
    };

    do
    {
        /* Send out and wait the acknowledgment via IRQ */
        err = _send_request_with_ack(drv_ctx, (void *)&subghz_standby_frame, sizeof(subghz_standby_frame), STM32WLxx_HAL_RADIO_SUBGHZ_STANDBY_TIMEOUT_MS);

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            /* Everything is fine */
        }
        else if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send STM32WLxx SubGHz Standby request - acknowledgment timeout");
            break;
        }
        else
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send STM32WLxx SubGHz Standby request. HAL error %u", (uint32_t)err);
            break;
        }

        /* Inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_STANDBY))
        {
            SID_PAL_LOG_ERROR("SubGHz Standby failed. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_STANDBY, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("SubGHz Standby failed. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        STM32WLxx_HAL_LOG_DEBUG("SubGHz Standby request succeeded");
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_sleep(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t sleep_us, const uint32_t deep_sleep_request)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t subghz_sleep_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SLEEP,
        .payload = {
            .radio_sleep = {
                .sleep_duration_us = sleep_us,
                .deep_sleep_key_1  = 0u,
                .deep_sleep_key_2  = 0u,
                .deep_sleep_en     = FALSE,
            },
        },
    };

    do
    {
        if (deep_sleep_request != FALSE)
        {
            if (sleep_us != 0u)
            {
                /* Deep sleep is only allowed if Sidewalk is not going to operate the radio */
                err = STM32WLxx_HAL_STATUS_INVALID_ARGS;
                break;
            }

            /* Indicate that this is a deep-sleep request */
            subghz_sleep_frame.payload.radio_sleep.deep_sleep_en    = 1u;
            subghz_sleep_frame.payload.radio_sleep.deep_sleep_key_1 = STM32WLxx_RADIO_COMM_DEEP_SLEEP_KEY_1;
            subghz_sleep_frame.payload.radio_sleep.deep_sleep_key_2 = STM32WLxx_RADIO_COMM_DEEP_SLEEP_KEY_2;
        }

        /* Send out and wait the acknowledgment via IRQ */
        err = _send_request_with_ack(drv_ctx, (void *)&subghz_sleep_frame, sizeof(subghz_sleep_frame), STM32WLxx_HAL_RADIO_SUBGHZ_SLEEP_TIMEOUT_MS);

        if (STM32WLxx_HAL_STATUS_OK == err)
        {
            /* Everything is fine */
        }
        else if (STM32WLxx_HAL_STATUS_ERROR_TIMEOUT == err)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send STM32WLxx SubGHz sleep mode request - acknowledgment timeout");
            break;
        }
        else
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send STM32WLxx SubGHz sleep mode request. HAL error %u", (uint32_t)err);
            break;
        }

