stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
        /* Inspect the received IRQ status */
        const stm32wlxx_req_completed_irq_details_t * const irq_details = &drv_ctx->last_irq_status.req_cmpltd_details;
        if ((drv_ctx->last_irq_status.irq_flags != STM32WLxx_APP_IRQ_SPI_REQ_DONE) || (irq_details->request_id != STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SLEEP))
        {
            SID_PAL_LOG_ERROR("SubGHz Sleep failed. IRQ clash detected. Expected 0x%x flag, but got 0x%x, req_id 0x%x",
                              STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SLEEP, drv_ctx->last_irq_status.irq_flags, irq_details->request_id);
            err = STM32WLxx_HAL_STATUS_ERROR_UNEXPECTED_DATA;
            break;
        }

        if (irq_details->status != 0u)
        {
            SID_PAL_LOG_ERROR("SubGHz Sleep failed. STM32WLxx returned error code %u", irq_details->status);
            err = STM32WLxx_HAL_STATUS_ERROR_REJECTED;
            break;
        }

        STM32WLxx_HAL_LOG_DEBUG("SubGHz Sleep request succeeded");
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_set_modem_mode(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, stm32wlxx_pal_radio_modem_mode_t mode)
{
    SID_PAL_ASSERT(mode <= UINT8_MAX); /* Ensure the enum value fits into one byte */

    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t set_modem_mode_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_MODEM_MODE,
        .payload = {
            .set_modem_mode = {
                .mode = (uint8_t)mode,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (uint8_t *)(void *)&set_modem_mode_frame, sizeof(set_modem_mode_frame));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        /* SPI failed */
        STM32WLxx_HAL_LOG_ERROR("Unable to send STM32WLxx SubGHz Set Modem Mode request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_set_frequency(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t freq)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t set_frequency_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_FREQUENCY,
        .payload = {
            .set_frequency = {
                .frequency = freq,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (uint8_t *)(void *)&set_frequency_frame, sizeof(set_frequency_frame));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        /* SPI failed */
        STM32WLxx_HAL_LOG_ERROR("Unable to send STM32WLxx SubGHz Set Frequency request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_set_syncword(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const stm32wlxx_pal_radio_modem_mode_t target_modem, const uint8_t * const sync_word, const uint32_t sync_word_len)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_syncword_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SUBGHZ_SET_SYNCWORD,
        .payload = {
            .set_sync_word = {
                .modem = target_modem,
            },
        },
    };

    do
    {
        if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_FSK == target_modem)
        {
            SID_PAL_ASSERT(sync_word_len <= STM32WLxx_RADIO_COMM_FSK_SYNC_WORD_LENGTH);
            set_syncword_req.payload.set_sync_word.fsk_sync_word.data_len = (uint8_t)sync_word_len;
            SID_STM32_UTIL_fast_memcpy(set_syncword_req.payload.set_sync_word.fsk_sync_word.data, sync_word, sync_word_len);
        }
        else if (STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA == target_modem)
        {
        	SID_PAL_ASSERT(sync_word_len == sizeof(set_syncword_req.payload.set_sync_word.lora_sync_word));
            const uint16_t * const src_ptr = (uint16_t *)(void *)sync_word;
            set_syncword_req.payload.set_sync_word.lora_sync_word = *src_ptr;
        }
        else
        {
            STM32WLxx_HAL_LOG_ERROR("Can't set sync word - invalid modem specified: %u", (uint32_t)target_modem);
            err = STM32WLxx_HAL_STATUS_INVALID_ARGS;
            break;
        }

        err = _spi_transmit_data(drv_ctx, (void *)&set_syncword_req, sizeof(set_syncword_req));
        if (err != STM32WLxx_HAL_STATUS_OK)
        {
            STM32WLxx_HAL_LOG_ERROR("Failed to send Set Sync Word request. SPI transfer error %u", (uint32_t)err);
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_set_lora_symbol_timeout(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t symb_timeout)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_lora_symb_to_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_SYMB_TIMEOUT,
        .payload = {
            .set_lora_symb_timeout = {
                .symbol_timeout = symb_timeout,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&set_lora_symb_to_req, sizeof(set_lora_symb_to_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Set LoRa Symbol Timeout request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_set_lora_modulation_params(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const stm32wlxx_radio_lora_phy_mod_params_t * const mod_params)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_lora_mod_params_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_LORA_MOD_PARAMS,
        .payload = {
            .set_lora_mod_params = {
                .mod_params = *mod_params,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&set_lora_mod_params_req, sizeof(set_lora_mod_params_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Set LoRa Modulation Params request. SPI transfer error %u", (uint32_t)err);
    }

