stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
        /* Store the received IRQ status */
        SID_STM32_UTIL_fast_memcpy(irq_status, &irq_status_read_reply.payload.irq_status, sizeof(*irq_status));

        /* Check if there's follow-up data pending */
        if (irq_status->followup_payload_len > 0u)
        {
            /* There's some data to read out */
            if ((followup_data_buf != NULL) && (followup_buf_limit >= irq_status->followup_payload_len))
            {
                /* Case 1 - the caller supplied the Rx buffer and there's enough space in there - receive directly into the buffer */
                size_t actually_received;
                err = _spi_receive_data(drv_ctx, followup_data_buf, irq_status->followup_payload_len, &actually_received);

                if (err != STM32WLxx_HAL_STATUS_OK)
                {
                    /* SPI failed */
                    STM32WLxx_HAL_LOG_ERROR("Unable to read out IRQ follow-up data. SPI transfer error %u", (uint32_t)err);
                    break;
                }
                else
                {
                    /* SPI transaction completed successfully, but we have a few more thing to assert */
                    if (actually_received != irq_status->followup_payload_len)
                    {
                        /* Mismatch between the expected and actually received amount of the follow-up data */
                        SID_PAL_LOG_ERROR("Failed to read out IRQ follow-up data. Expected %u bytes, but got only %u", irq_status->followup_payload_len, actually_received); /* This is serious as it may mean mismatch between irq_status->followup_payload_len and what is actually enqueued on STM32WLxx side - always log this error */
                        err = STM32WLxx_HAL_STATUS_ERROR_INCOMPLETE_XFER;
                        break;
                    }
                    else
                    {
                        /* Everything is ok */
                        STM32WLxx_HAL_LOG_DEBUG("Successfully received %u bytes of IRQ follow-up data.", actually_received);
                    }
                }
            }
            else
            {
                /* Case 2 - the provided buffer is too short + Case 3 - caller is not interested in the follow-up data */
                size_t actually_received;

                /* Perform dummy read to clean up STM32WLxx Tx buffer from the IRQ data completely */
                err = _spi_receive_data(drv_ctx, NULL, 0u, &actually_received);

                if (err != STM32WLxx_HAL_STATUS_OK)
                {
                    /* SPI failed */
                    STM32WLxx_HAL_LOG_ERROR("Unable to do dummy read of IRQ follow-up data. SPI transfer error %u", (uint32_t)err);
                    break;
                }
                else
                {
                    /* SPI transaction completed successfully, but we have a few more thing to assert */
                    if (actually_received != irq_status->followup_payload_len)
                    {
                        /* Mismatch between the expected and actually received amount of the follow-up data */
                        SID_PAL_LOG_ERROR("Failed to read out IRQ follow-up data. Expected %u bytes, but got only %u", irq_status->followup_payload_len, actually_received); /* This is serious as it may mean mismatch between irq_status->followup_payload_len and what is actually enqueued on STM32WLxx side - always log this error */
                        err = STM32WLxx_HAL_STATUS_ERROR_INCOMPLETE_XFER;
                        break;
                    }
                    else
                    {
                        /* Everything is ok */
                        STM32WLxx_HAL_LOG_DEBUG("Successfully done dummy read of IRQ follow-up data. Received %u bytes ", actually_received);
                    }
                }

                /* Report and error  */
                if ((followup_data_buf != NULL) && (followup_buf_limit < irq_status->followup_payload_len))
                {
                    STM32WLxx_HAL_LOG_ERROR("Failed to read out IRQ follow-up data. Expected %u bytes, but reception buffer can store only %u", irq_status->followup_payload_len, followup_buf_limit);
                    err = STM32WLxx_HAL_STATUS_ERROR_BUFFER_OVERFLOW;
                    break;
                }
            }
        }

        /* Everything is ok if we've got here */
        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_acknowledge_radio_irq(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    stm32wlxx_radio_comm_spi_frame_t irq_ack_frame = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_IRQ_ACK,
        .payload = {
            .raw = {0},
        }
    };

    err = _spi_transmit_data(drv_ctx, (uint8_t *)(void *)&irq_ack_frame, sizeof(irq_ack_frame));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        /* SPI failed */
        STM32WLxx_HAL_LOG_ERROR("Unable to send out STM32WLxx IRQ acknowledgment. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_wait_radio_irq_released(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t timeout_us)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_TIMEOUT;
    sid_error_t sid_err;
    uint8_t pin_state = STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_ACTIVE;
    uint32_t accumulated_wait_time = 0u;
    uint32_t debounce_cnt = 0u;

    while ((accumulated_wait_time < timeout_us) && (debounce_cnt < STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_PROBE_DEBOUNCE))
    {
        sid_err = sid_pal_gpio_read(drv_ctx->config->gpio.radio_irq, &pin_state);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("Wait for IRQ released - failed to read IRQ pin state. Error: %d", (int32_t)sid_err);
            err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
            break;
        }

