stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
        /* Return immediatly if the IRQ indication is cleared */
        if (STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_INACTIVE == pin_state)
        {
            debounce_cnt++;
        }
        else
        {
            debounce_cnt = 0u;
        }

        /* Wait a bit to avoid consuming a lot of power and blocking the APB bus */
        sid_pal_delay_us(STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_PROBE_PERIOD_US);
        accumulated_wait_time += STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_PROBE_PERIOD_US;
    }

    if ((debounce_cnt >= STM32WLxx_HAL_RADIO_IRQ_PIN_STATE_PROBE_DEBOUNCE) && (SID_ERROR_NONE == sid_err))
    {
        err = STM32WLxx_HAL_STATUS_OK;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_set_fsk_pkt_params(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, stm32wlxx_pal_radio_fsk_pkt_params_t pkt_params)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t set_fsk_pkt_params_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_SET_FSK_PKT_PARAMS,
        .payload = {
            .set_fsk_pkt_params = {
                .packet_params = pkt_params,
            },
        },
    };

    err = _spi_transmit_data(drv_ctx, (void *)&set_fsk_pkt_params_req, sizeof(set_fsk_pkt_params_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Set FSK Packet Params request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_radio_start_carrier_sense(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_carrier_sense_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_CARRIER_SENSE,
        .payload = {
            .raw = {0},
        }
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_carrier_sense_req, sizeof(start_carrier_sense_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start Carrier Sense request to SubGHz. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_start_continuous_wave_tx(const halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint32_t freq)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_cw_tx_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_CW_TX,
        .payload = {
            .start_cw_tx_params = {
                .frequecy = freq,
            },
        }
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_cw_tx_req, sizeof(start_cw_tx_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start SubGHz CW Tx request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

#if HALO_ENABLE_DIAGNOSTICS
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_start_continuous_rx(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err;
    stm32wlxx_radio_comm_spi_frame_t start_continuous_rx_req = {
        .opcode = STM32WLxx_RADIO_COMM_OPCODE_START_CONTINUOUS_RX,
        .payload = {
            .raw = {0},
        }
    };

    err = _spi_transmit_data(drv_ctx, (void *)&start_continuous_rx_req, sizeof(start_continuous_rx_req));
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        STM32WLxx_HAL_LOG_ERROR("Failed to send Start SubGHz Continuous Rx request. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}
#endif /* HALO_ENABLE_DIAGNOSTICS */

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_hal_send_user_data(halo_drv_stm32wlxx_ctx_t * const drv_ctx, const uint8_t * const data, const uint32_t data_len)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;

    SID_PAL_ASSERT(drv_ctx->config->internal_buffer.p != NULL);
    SID_PAL_ASSERT(data_len <= STM32WLxx_RADIO_COMM_SUBGHZ_TX_MAX_SIZE);

    stm32wlxx_rcp_user_data_t * const user_data_frame = (stm32wlxx_rcp_user_data_t *)(void *)drv_ctx->config->internal_buffer.p;

    user_data_frame->opcode      = STM32WLxx_RADIO_COMM_OPCODE_USER_DATA;
    user_data_frame->data_length = (uint16_t)data_len;
    SID_STM32_UTIL_fast_memcpy(user_data_frame->data, data, data_len);

    uint32_t actual_frame_length = sizeof(*user_data_frame) - sizeof(user_data_frame->data) + data_len;

    err = _spi_transmit_data(drv_ctx, (uint8_t *)(void *)user_data_frame, actual_frame_length);
    if (err != STM32WLxx_HAL_STATUS_OK)
    {
        /* SPI failed */
        STM32WLxx_HAL_LOG_ERROR("Unable to send user data to the STM32WLxx side. SPI transfer error %u", (uint32_t)err);
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_radio_hal_init_gpio(halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;

    do
    {
#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Configure status LED ------------------------------------------------------*/
        /* Tx LED */
        if (HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.tx_led)
        {
            /* Make sure LED won't glitch - put GPIO output to Off state before the pin is configured as output */
            stm32wlxx_radio_hal_tx_led_off(drv_ctx);

            sid_err = sid_pal_gpio_output_mode(drv_ctx->config->gpio.tx_led, SID_PAL_GPIO_OUTPUT_PUSH_PULL);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_output_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.tx_led, SID_PAL_GPIO_DIRECTION_OUTPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_set_direction() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
        }

        /* Rx LED */
        if ((HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.rx_led) && (drv_ctx->config->gpio.rx_led != drv_ctx->config->gpio.tx_led))
        {
            stm32wlxx_radio_hal_rx_led_off(drv_ctx);

            sid_err = sid_pal_gpio_output_mode(drv_ctx->config->gpio.rx_led, SID_PAL_GPIO_OUTPUT_PUSH_PULL);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_output_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.rx_led, SID_PAL_GPIO_DIRECTION_OUTPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_set_direction() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
        }
        /*----------------------------------------------------------------------------*/
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

