stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_hal.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_radio_hal_deinit_gpio(halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_ERROR_GENERIC;
    sid_error_t sid_err;

    do
    {
#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
        /* Set status LED pin to Hi-Z ------------------------------------------------*/
        /* Tx LED */
        if (HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.tx_led)
        {
            sid_err = sid_pal_gpio_input_mode(drv_ctx->config->gpio.tx_led, SID_PAL_GPIO_INPUT_DISCONNECT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_input_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }

            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.tx_led, SID_PAL_GPIO_DIRECTION_INPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_set_direction() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
        }

        /* Rx LED */
        if ((HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.rx_led) && (drv_ctx->config->gpio.rx_led != drv_ctx->config->gpio.tx_led))
        {
            sid_err = sid_pal_gpio_input_mode(drv_ctx->config->gpio.rx_led, SID_PAL_GPIO_INPUT_DISCONNECT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_input_mode() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }

            sid_err = sid_pal_gpio_set_direction(drv_ctx->config->gpio.rx_led, SID_PAL_GPIO_DIRECTION_INPUT);
            if (sid_err != SID_ERROR_NONE)
            {
                STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_set_direction() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
                err = STM32WLxx_HAL_STATUS_ERROR_GPIO;
                break;
            }
        }
        /*----------------------------------------------------------------------------*/
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

        err = STM32WLxx_HAL_STATUS_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_radio_hal_tx_led_on(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_OK;

    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    if (HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.tx_led)
    {
        sid_error_t sid_err;
        uint8_t write_val = drv_ctx->config->gpio.tx_led_on_gpio_state != 0u ? 1u : 0u;

        sid_err = sid_pal_gpio_write(drv_ctx->config->gpio.tx_led, write_val);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_write() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
        }
    }

    return err;
}
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

/*----------------------------------------------------------------------------*/

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_radio_hal_tx_led_off(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_OK;

    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    if (HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.tx_led)
    {
        sid_error_t sid_err;
        uint8_t write_val = drv_ctx->config->gpio.tx_led_on_gpio_state != 0u ? 0u : 1u;

        sid_err = sid_pal_gpio_write(drv_ctx->config->gpio.tx_led, write_val);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_write() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.tx_led);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
        }
    }

    return err;
}
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

/*----------------------------------------------------------------------------*/

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_radio_hal_rx_led_on(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_OK;

    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    if (HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.rx_led)
    {
        sid_error_t sid_err;
        uint8_t write_val = drv_ctx->config->gpio.rx_led_on_gpio_state != 0u ? 1u : 0u;

        sid_err = sid_pal_gpio_write(drv_ctx->config->gpio.rx_led, write_val);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_write() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
        }
    }

    return err;
}
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */

/*----------------------------------------------------------------------------*/

#if STM32WLxx_RADIO_CFG_USE_STATUS_LED
SID_STM32_SPEED_OPTIMIZED stm32wlxx_hal_status_t stm32wlxx_radio_hal_rx_led_off(const halo_drv_stm32wlxx_ctx_t * const drv_ctx)
{
    stm32wlxx_hal_status_t err = STM32WLxx_HAL_STATUS_OK;

    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    if (HALO_GPIO_NOT_CONNECTED != drv_ctx->config->gpio.rx_led)
    {
        sid_error_t sid_err;
        uint8_t write_val = drv_ctx->config->gpio.rx_led_on_gpio_state != 0u ? 0u : 1u;

        sid_err = sid_pal_gpio_write(drv_ctx->config->gpio.rx_led, write_val);
        if (sid_err != SID_ERROR_NONE)
        {
            STM32WLxx_HAL_LOG_ERROR("sid_pal_gpio_write() failed with error code %d, pin: %u", (int32_t)sid_err, drv_ctx->config->gpio.rx_led);
            err = STM32WLxx_HAL_STATUS_ERROR_HW;
        }
    }

    return err;
}
#endif /* STM32WLxx_RADIO_CFG_USE_STATUS_LED */
